Revit 2024 API
BuiltInFailures Class
Provides a container of all Revit built-in FailureDefinitionId instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class BuiltInFailures
Visual Basic
Public NotInheritable Class BuiltInFailures
Visual C++
public ref class BuiltInFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures
See Also
Autodesk.Revit.DB Namespace